package com.test.java.obj;

public class Ex32_Class {

	public static void main(String[] args) {
		
		/*
			- 보통 자바에서는 물리적인 파일 1개에 쿨래스를 (되도록) 1개만 선언한다.
			- 이유 > 관리 차원에서...
				-> Ex20_if 클래스에서 문제 발생 > "Ex20_if.java" 파일 안에 클래스가 존재
				-> Size 클래스에서 문제 발생  > 파일 이름에 size라는 이름이 없어서 파일을 바로 찾기가 어려움 > 전부 다 찾아야함 > 퀵서치로 찾으면 펀함(ctrl+shift+L)
			- 절대 규칙] 파일의 이름과 클래스의 이름이 ***반드시*** 동일해야 한다.
				> 위반하면 컴파일 오류 발생
			- 파일 1개에 N개의클래스를 선언할 수 있다.
				> 파일 안의 N개의 클래스 중 public을 가질 수 있는 클래스는 딱 1개
				> public 클래스 == 대표 클래스 > 대표 클래스의 이름이 파일명이 된다.
		
		*/
		
		
	}
}
